In [12]:
import pandas as pd

In [13]:
df = pd.DataFrame()

In [14]:
df

Empty DataFrame
Columns: []
Index: []

In [15]:
# initialize list of lists
data = [['tom', 10], ['nick', 15], ['juli', 14]]
 
# Create the pandas DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age'])
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [21]:
df.to_csv("data.csv", index=False)

In [27]:
df1 = pd.read_csv("data.csv")
df1

   Name  Age
0   tom   10
1  nick   15
2  juli   14
3   tom   56
4  nick   11

In [28]:
df1["Name"]

0     tom
1    nick
2    juli
3     tom
4    nick
Name: Name, dtype: object

In [32]:
df1

   Name  Age
0   tom   10
1  nick   15
2  juli   14
3   tom   56
4  nick   11

In [35]:
df1.head(2)

   Name  Age
0   tom   10
1  nick   15

In [37]:
df1.tail(2)

   Name  Age
3   tom   56
4  nick   11

In [38]:
df1.describe()

            Age
count   5.00000
mean   21.20000
std    19.56272
min    10.00000
25%    11.00000
50%    14.00000
75%    15.00000
max    56.00000

In [33]:
df1.info

<bound method DataFrame.info of    Name  Age
0   tom   10
1  nick   15
2  juli   14
3   tom   56
4  nick   11>

In [29]:
df1["Name"].unique()

array(['tom', 'nick', 'juli'], dtype=object)

In [30]:
df1["Name"].tolist()

['tom', 'nick', 'juli', 'tom', 'nick']

In [31]:
set(df1["Name"].tolist())

{'juli', 'nick', 'tom'}

In [25]:
for row in df1:
    print(row)

Name
Age

In [8]:
df1.columns

Index(['Name', 'Age'], dtype='object')

In [9]:
df1.index

RangeIndex(start=0, stop=4, step=1)